//using System;
//using System.Collections.Generic;
//using System.Linq;
//using System.Threading.Tasks;

//namespace SocialContact.Api
//{
//   public enum Code
//    {
//        账户不能为空=40000,
//        密码不能为空=40001, 
//        登录失败 = 40002,
//        登录成功 = 40003, 
//        系统繁忙 = 40004,
//        Token不能为空 = 40005,
//        Token不存在 = 40006, 
//        退出成功 = 40007,
//        参数不能为空=40008,
//        添加成功 = 40009,
//        修改成功=40010,
//        删除成功=40011,
//        查询成功 = 40012, 
//        Token失效 = 40013, 
//        上传成功 = 40014, 
//        上传失败 = 40015, 
//        文件不存在 = 40016,
//        操作成功 = 40017,
//        认证失败 = 40018,
//        删除失败 = 40019,
//        级联无法删除=40020,
//        上传文件失败 = 40021,
//        上传文件格式错误 = 40022,
//        不支持的操作 = 40023,
//        操作失败 = 40024,
//    }
//}
